[NoCoverage] String mutation
proyecto-si784-2025-i-u2-scae-upt/WebApp/pyWeb_ScaeUPT/Program.cs:40:44
 
 builder.Services.AddDbContext<pyWeb_ScaeUPT.Data.ApplicationDbContext>(options =>
     options.UseMySql(
-        Environment.GetEnvironmentVariable("MYSQL_CONNECTION_STRING"),
+        Environment.GetEnvironmentVariable(""),
         ServerVersion.AutoDetect(Environment.GetEnvironmentVariable("MYSQL_CONNECTION_STRING"))
     ));

[Survived] String mutation
proyecto-si784-2025-i-u2-scae-upt/WebApp/pyWeb_ScaeUPT/Program.cs:47:36
 
 // Leer valores de configuración para JWT
 var secretKey = Environment.GetEnvironmentVariable("JWT_SECRET_KEY");
-var issuer = builder.Configuration["JWT:Issuer"];
+var issuer = builder.Configuration[""];
 var audience = builder.Configuration["JWT:Audience"];
 

[Survived] Object initializer mutation
proyecto-si784-2025-i-u2-scae-upt/WebApp/pyWeb_ScaeUPT/Program.cs:58:41
 })
 .AddJwtBearer(options =>
 {
-    options.TokenValidationParameters = new TokenValidationParameters
-    {
-        ValidateIssuer = true,
-        ValidateAudience = true,
-        ValidateLifetime = true,
-        ValidateIssuerSigningKey = true,
-
-        ValidIssuer = issuer,
-        ValidAudience = audience,
-        IssuerSigningKey = new SymmetricSecurityKey(Encoding.UTF8.GetBytes(secretKey))
-    };
+    options.TokenValidationParameters = new TokenValidationParameters
+{};
 });
 
